In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
dframe = DataFrame({'key1': ['A']*2 + ['B']*3,
                   'keuy2': [2,2,2,3,3]})
dframe

  key1  keuy2
0    A      2
1    A      2
2    B      2
3    B      3
4    B      3

In [3]:
dframe.duplicated()

# 0    False  : no same duplicate before (unique)
# 1     True  : same duplicate before
# 2    False  : no same duplicate before (unique)
# 3    False  : no same duplicate before (unique)
# 4     True  : same duplicate before

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [4]:
dframe.drop_duplicates()

  key1  keuy2
0    A      2
2    B      2
3    B      3

In [6]:
dframe.drop_duplicates(['key1'])
# drop the duplicates from key1

  key1  keuy2
0    A      2
2    B      2

In [7]:
dframe

  key1  keuy2
0    A      2
1    A      2
2    B      2
3    B      3
4    B      3

In [12]:
#dframe.drop_duplicates(['key1'], take_last = True) X
dframe.drop_duplicates(['key1'], keep = 'last')

# df.drop_dupplicates(): https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop_duplicates.html

  key1  keuy2
1    A      2
4    B      3